/**
 * Created by wangwenliang on 2017/7/14.
 * 该文件用于显示购物车网络请求错误提示
 * 1、/api/orders/carts/detailItemToCart
 * 2、/api/orders/carts/addToCart
 */
// import ToastShow from '../../../../foundation/common/ToastShow'


// 1030100799:立即购买失败
// 1030100198:添加购物车失败
// 1030100297:更新购物车失败
// 1030100296:更新赠品购物车失败
// 1030100495:查询购物车失败
// 1030100894:选择购物车失败
// 1030100593:查询购物车商品件数总数车失败
// 1030100701:商品件数最低为一件
// 1030100702:请先登录
// 1030100703:TV商品单笔订单最多只可订购10件
// 1030100704:配送至XXX商品无库存
// 1030100705:配送至XXX商品无库存,无库存
// 1030100706:参数缺失
// 1030100707:购物车已满，请删除一些商品后再购买
// 1030100708:尊敬的顾客，此商品在活动期间限购一件，您已订购了一件，无法购买
// 1030100301:编号为XXX的购物车已不存在,请重新操作.
// 1030100302:购物车删除失败
// 1030100101:非常抱歉，商品XXX为限定类商品，仅限特定顾客订购，请重新选择商品，谢谢！
// 1030100102:其他信息
// 1030100103:商品数量上限最多99件
// 1030100201:货号为:XXX的赠品修改失败
// 1030100401:查询商品活动失败
// 1030100402:查询商品单价失败
// 1030100403:查询商品图片失败


// code===1030100799 ||
// code===1030100198 ||
// code===1030100701 ||
// code===1030100702 ||
// code===1030100703 ||
// code===1030100704 ||
// code===1030100705 ||
// code===1030100706 ||
// code===1030100707 ||
// code===1030100708 ||
// code===1030100101 ||
// code===1030100102 ||
// code===1030100103

functionUtils = {
    errShow:(err) => {
       if (err){
           let code = err.code || "";
           let msg = err.message || "网络异常";

           return msg;
       }
       return "网络异常";
    }

}
export default functionUtils;