/**
 * Created by wangwenliang  on 2017/7/4.
 */
export const TYPE_SELF='TYPE_SELF';
export const TYPE_SELF_4='TYPE_SELF_4';
export const TYPE_SELF_5='TYPE_SELF_5';
export const TYPE_DIRECT_MAIL1='TYPE_DIRECT_MAIL1';
export const TYPE_WORK_MAIL='TYPE_WORK_MAIL';
export const SELF_CONTENT=
    '1.本商品由韩国嗨鸥全球购株式会社提供，所有商品从海外直采，100%正品保证，敬请放心订购。'+'\n\n'+
    '2.本商品从上海自贸区发货，上海地区配送时间为清关后2-5天，其他地区清关后5-10天；如遇节假日、订单需要实名认证等特殊情况，或者遇台风、暴雨、大雾等不可抗力的原因下，送达时间将根据具体到达情况而定。'+'\n\n'+
    '3.本商品清关时需依法向中国海关申报及纳税，提交订单时需要填写个人身份证号，用于授权东方全球购代为进行订购货品入境申报，用户的身份证信息将仅用于入境申报，并对此严格保密，绝不泄露。订购人即为中国进口方，信息必须真实有效，而且需要与支付账户人信息一致。如因信息不一致、不真实而产生的海关无法清关，由顾客承担全部责任和损失。'+'\n\n'+
    '4.根据海关相关法规，单笔订单限额人民币2000元。'+'\n\n'+
    '5.本商品不支持无理由退换货，若收到的商品有质量问题，请联系我们的客服中心。'+'\n\n'+
    '6.国外原装商品包装更新较频繁，商品外包装请以收到的实物为准，我们会尽快更新商品图片。'+'\n\n'+
    '7.自贸区商品是境外商品，商品标签和包装、手册、说明书及安全警示可能没有中文版本；且商品是按照进口国的标准与使用习惯设计的。'+'\n\n'+
    '8.本商品为境外商品，不提供发票，商品以在海关备案方式确保所有展示商品是正品, 请您放心。'
;

export const SELF_CONTENT_4=
    '1.本商品由东方购物贸易有限公司提供，所有商品从海外直采，100%正品保证，敬请放心订购。'+'\n\n'+
    '2.本商品从上海自贸区发货，上海地区配送时间为清关后2-5天，其他地区清关后5-10天；如遇节假日、订单需要实名认证等特殊情况，或者遇台风、暴雨、大雾等不可抗力的原因下，送达时间将根据具体到达情况而定。'+'\n\n'+
    '3.本商品清关时需依法向中国海关申报及纳税，提交订单时需要填写个人身份证号，用于授权东方全球购代为进行订购货品入境申报，用户的身份证信息将仅用于入境申报，并对此严格保密，绝不泄露。订购人即为中国进口方，信息必须真实有效，而且需要与支付账户人信息一致。如因信息不一致、不真实而产生的海关无法清关，由顾客承担全部责任和损失。'+'\n\n'+
    '4.根据海关相关法规，单笔订单限额人民币2000元。'+'\n\n'+
    '5.本商品不支持无理由退换货，若收到的商品有质量问题，请联系我们的客服中心。'+'\n\n'+
    '6.国外原装商品包装更新较频繁，商品外包装请以收到的实物为准，我们会尽快更新商品图片。'+'\n\n'+
    '7.自贸区商品是境外商品，商品标签和包装、手册、说明书及安全警示可能没有中文版本；且商品是按照进口国的标准与使用习惯设计的。'+'\n\n'+
    '8.本商品为境外商品，不提供发票，商品以在海关备案方式确保所有展示商品是正品, 请您放心。'
;

export const SELF_CONTENT_5=
    '1.本商品由株式会社bolome提供，所有商品从海外直采，100%正品保证，敬请放心订购。'+'\n\n'+
    '2.本商品从宁波自贸区发货，上海地区配送时间为清关后2-5天，其他地区清关后5-10天；如遇节假日、订单需要实名认证等特殊情况，或者遇台风、暴雨、大雾等不可抗力的原因下，送达时间将根据具体到达情况而定。'+'\n\n'+
    '3.本商品清关时需依法向中国海关申报及纳税，提交订单时需要填写个人身份证号，用于授权东方全球购代为进行订购货品入境申报，用户的身份证信息将仅用于入境申报，并对此严格保密，绝不泄露。订购人即为中国进口方，信息必须真实有效，而且需要与支付账户人信息一致。如因信息不一致、不真实而产生的海关无法清关，由顾客承担全部责任和损失。'+'\n\n'+
    '4.根据海关相关法规，单笔订单限额人民币2000元。'+'\n\n'+
    '5.本商品不支持无理由退换货，若收到的商品有质量问题，请联系我们的客服中心。'+'\n\n'+
    '6.国外原装商品包装更新较频繁，商品外包装请以收到的实物为准，我们会尽快更新商品图片。'+'\n\n'+
    '7.自贸区商品是境外商品，商品标签和包装、手册、说明书及安全警示可能没有中文版本；且商品是按照进口国的标准与使用习惯设计的。'+'\n\n'+
    '8.本商品为境外商品，不提供发票，商品以在海关备案方式确保所有展示商品是正品, 请您放心。'
;

export const DIRECT_CONTENT=
    '1.本商品由东方购物贸易有限公司提供，所有商品从海外直接发货，100%正品保证，敬请放心订购。'+'\n\n'+
    '2.本商品从境外发货，运送至国内的配送时长约为15-30个天，如遇节假日、订单需要实名认证等特殊情况，或者遇台风、暴雨、大雾等不可抗力的原因下，订单到达时间将根据具体到达情况而定。'+'\n\n'+
    '3.本商品清关时需依法向中国海关申报及纳税，提交订单时需要填写个人身份证号，用于授权东方全球购代为进行订购货品入境申报，用户的身份证信息将仅用于入境申报，并对此严格保密，绝不泄露。订购人即为中国进口方，信息必须真实有效，而且需要与支付账户人信息一致。如因信息不一致、不真实而产生的海关无法清关，由顾客承担全部责任和损失。'+'\n\n'+
    '4.根据海关相关法规，单笔订单限额人民币2000元。'+'\n\n'+
    '5.本商品不支持无理由退换货，若收到的商品有质量问题，请联系我们的客服中心。'+'\n\n'+
    '6.国外原装商品包装更新较频繁，商品外包装请以收到的实物为准，我们会尽快更新商品图片。'+'\n\n'+
    '7.自贸区商品是境外商品，商品标签和包装、手册、说明书及安全警示可能没有中文版本；且商品是按照进口国的标准与使用习惯设计的。'+'\n\n'+
    '8.本商品为境外商品，不提供发票，商品以在海关备案方式确保所有展示商品是正品, 请您放心。'
;


export const WORK_CONTENT=
    '1.本商品由东方购物贸易有限公司提供，所有商品从海外直接发货，100%正品保证，敬请放心订购。'+'\n\n'+
    '2.本商品从境外发货，运送至国内的配送时长约为15-30个天，如遇节假日、订单需要实名认证等特殊情况，或者遇台风、暴雨、大雾等不可抗力的原因下，订单到达时间将根据具体到达情况而定。'+'\n\n'+
    '3.本商品清关时需依法向中国海关申报及纳税，提交订单时需要填写个人身份证号，用于授权东方全球购代为进行订购货品入境申报，用户的身份证信息将仅用于入境申报，并对此严格保密，绝不泄露。订购人即为中国进口方，信息必须真实有效，而且需要与支付账户人信息一致。如因信息不一致、不真实而产生的海关无法清关，由顾客承担全部责任和损失。'+'\n\n'+
    '4.本商品不支持无理由退换货，若收到的商品有质量问题，请联系我们的客服中心。'+'\n\n'+
    '5.国外原装商品包装更新较频繁，商品外包装请以收到的实物为准，我们会尽快更新商品图片。'+'\n\n'+
    '6.自贸区商品是境外商品，商品标签和包装、手册、说明书及安全警示可能没有中文版本；且商品是按照进口国的标准与使用习惯设计的。'+'\n\n'+
    '7.本商品为境外商品，不提供发票，商品以在海关备案方式确保所有展示商品是正品, 请您放心。'+'\n\n'+
    '8..目前只有部分省市可以提供配送服务，可配送地区：上海、安徽、江西、甘肃、宁夏、青海、贵州。'
;


export function getNoticeByType(type) {
    switch (type){
        case TYPE_SELF:
            return SELF_CONTENT;
        case  TYPE_DIRECT_MAIL1:
            return DIRECT_CONTENT;
        case TYPE_WORK_MAIL:
            return WORK_CONTENT;
        case TYPE_SELF_4 :
            return SELF_CONTENT_4;
        case TYPE_SELF_5 :
            return SELF_CONTENT_5;
    }
    return '';
}