/**
 * Created by jzz on 2017/6/14.
 */

 const data = {
    tax: {
        title: '跨境综合税',
        smallTitle: '跨境综合税',
        context: '跨境综合税说明',
    },
    firstBuy: {
        title: '首购优惠说明',
        smallTitle: '首购优惠说明',
        context:'1）首购新客户通过手机/PAD客户端成功订购即可参加此活动，指定TV商品可最高立减200元（以实际下单为准)；' + '\n\n' +
                '2）首购新客定义：当笔下单前从未通过手机/PAD客户端（一个设备只享受一次）的订购成功顾客；' + '\n\n' +
                '3）首购优惠不与移动端立减优惠，抵用券，两件立减，组合购，拼团等促销同享；若下单后发生未支付请于订单转为支付失败的24小时后再次订购（确认程序逻辑）；若下单后支付成功发生取消请于操作一小时后再次订购；退货，预约，拒收等不再享受首购优惠；' + '\n\n' +
                '4）首购仅限单件商品享受，若购物车中有多件商品，系统自动挑选符合条件的优惠力度最大的单件商品享受首购优惠，如果优惠力度最大的商品为两件或两件以上，则取一件享受首购优惠；' + '\n\n' +
                '5）以下商品不参与首购立减：贵金属，收藏类，裸钻，房产，无形商品，预约商品，手续费商品，定金类商品，定制类商品，票务，保险，汽车，爆款商品，TV预售等特殊商品不参与；' + '\n\n' +
                '6）首购立减优惠商品的积分以实际赋予为准。'
    },
    shoppingDescription: {
        title: '东方购物说明',
        smallTitle: '东方购物说明',
        context: '东方购物说明',
    },
    identityInfoDescription: {
        title: '证件信息填写说明',
        smallTitle: '证件信息填写说明',
        context: '请您务必填写真实的个人身份证信息，每个实名信息每年限购2万元，此信息只用于海关报税，信息不会公开或做其他使用。如因信息不一致、不真实产生的海关无法清关，由顾客承担全部责任和损失。',
    },
    delegateInfo: {
        title: '个人委托申报协议',
        smallTitle: '协议内容',
        context: '本人承诺所购买商品系个人合理自用，现委托商家代理申报、代缴税款等相关事宜，本人保证遵守《海关法》和国家相关法律法规，保证所提供的的身份信息和收货信息真实完整，无侵犯他人权益的行为，以上委托关系系如实填写，本人愿意接受海关、检验检疫机构及其他监管部门的监管，并承担相应法律责任。',
    }

}
export default data;